In [7]:
d = pandas.DataFrame([['Andy', 46, 'Engineer'], ['Jane', 33, 'Nurse'], ['Robert', 21, 'Student'], ['Maria', 30, 'Student']])
d = pandas.DataFrame([['Andy', 46, 'Engineer'], ['Jane', 33, 'Nurse'], ['Robert', 21, 'Student'], ['Maria', 30, 'Student']], columns = ['Name', 'Age', 'Occupation'])
d

     Name  Age Occupation
0    Andy   46   Engineer
1    Jane   33      Nurse
2  Robert   21    Student
3   Maria   30    Student

In [8]:
d = pandas.DataFrame([['Andy', 46, 'Engineer'], ['Jane', 33, 'Nurse'], ['Robert', 21, 'Student'], ['Maria', 30, 'Student']], columns = ['Name', 'Age', 'Occupation'], index = ['ID1', 'ID2', 'ID3', 'ID4'])

In [9]:
d

       Name  Age Occupation
ID1    Andy   46   Engineer
ID2    Jane   33      Nurse
ID3  Robert   21    Student
ID4   Maria   30    Student

In [10]:
d.Age.min()

21

In [ ]:
import lxml

In [ ]:
url = 'https://en.wikipedia.org/wiki/Python_(programming_language)'
d = pandas.read_html(url)

In [ ]:
d

In [ ]:
d = pandas.read_html(url)
d